[{"name": "Milwaukee Road Depot Clock Tower", "description": "\"The depot for the Milwaukee Road (Chicago, Milwaukee, and St. Paul Raiway) should look quite familiar to those who know the present-day hotel. But one prominent detail is different: the clock tower. Larry Millett's AIA Guide to the Twin Cities reports that the pinnacle (modeled on the Giralda in Seville, Spain) was damaged by high winds in 1941, leading to the present flat top.\"", "x": -13.826172, "y": 129.3125}, {"name": "Tent city?", "description": "\"I'd love to know the story of this little grouping of tents.\" I could not find records about it in newspapers at the time, but it is approximately where the Centurylink building is today. We will see if there's any other details we can uncover -- ER", "x": -27.204834, "y": 26.234375}, {"name": "Minneapolis Brewing Company", "description": "\"The Minneapolis Brewing Company began as a merger of four of the largest breweries in Minneapolis under the name of the Minneapolis Brewing and Malting Company.\"", "x": -6.2595215, "y": 99.140625}, {"name": "Washington Avenue Bikelane", "description": "\"It appears that this gentleman is establishing the first bike lane on Washington Avenue.\"", "x": -21.246948, "y": 123.871094}, {"name": "Nicollet Island", "description": "\"Apartment block at corner of W. Island and Grove St. Still extant.\"", "x": -9.3589844, "y": 109.630563}, {"name": "Dayton's", "description": "\"The original Dayton's department store.\"", "x": -9.4039062, "y": 10.375}, {"name": "Dayton's Building", "description": "\"Dayton's Building. At the time of this photo, the building would have housed the Dayton Dry Goods Company.\"", "x": -9.7781248, "y": 10.5506608}, {"name": "Pracna on Main", "description": "\"Pracna on Main built in 1890\"", "x": -7.8953857, "y": 150.5625}, {"name": "Old Orpheum Theater.", "description": "\"Modern Vaudeville”", "x": -9.3354492, "y": 19.875}, {"name": "Pillsbury \"A\" Mill", "description": "\"In 1879, after five years of secret planning, Charles Alfred Pillsbury announced to the public that he would build the largest and most advanced flour mill the world had ever seen. Construction started in 1880 and was finished in 1881 under a contractor named George McMullen. The mill was built to put out 5,000 barrels a day at a time when a 500-barrel mill was considered large.\"", "x": -6.6531982, "y": 160.570313}, {"name": "Food stand", "description": "\"Cool street vendor with a horse cart passing by\"", "x": -18.27713, "y": 2.80871582}, {"name": "Milwaukee Depot", "description": "\"Milwaukee Depot - Still standing today!\"", "x": -15.158447, "y": 129.892966}, {"name": "Masonic Temple", "description": "\"An example of Richardsonian Romanesque style of architecture, it was built to provide offices and lodging space for the Masonic Temple Association of Minneapolis. The Moorish onion domes on the corner towers were removed to deterioration.\"", "x": -8.6384277, "y": 34.65625}, {"name": "De LaSalle High School", "description": "\"Then-Archbishop John Ireland helped raise money in the late 1800s to build the new Catholic secondary school in Minneapolis. Fifty boys joined three teaching Christian Brothers in the new school in October 1900. The number of pupils rapidly expanded, and by spring, a fourth Brother had arrived to handle the overcrowding. By 1907, an addition had been added to the original building.\"", "x": -9.111084, "y": 111.335938}, {"name": "Dean Ballot Machine Co.", "description": "\"Dean Ballot Machine Co. -- Some sort of fracas outside the ballot company.\"", "x": -13.953979, "y": 162.222656}, {"name": "Rail yards", "description": "\"Lots of people riding the boxcars.\"", "x": -12.00085449, "y": 180.515625}, {"name": "Butler Brothers Company building", "description": "\"Originally built as a warehouse for Butler Brothers, a mail-order firm. The interior is built with heavy timber posts and beams from Aitkin, Minnesota. As truck transportation become more competitive with rail, it's urban location made it inefficient as a warehouse.\"", "x": -8.216552734, "y": 39.6015625}, {"name": "Donaldson's Glass Block", "description": "\"6th St and Nicollet Ave. 60ft Dome.  Destroyed by fire Thanksgiving 1982.\"", "x": -9.987792969, "y": 21.78125}, {"name": "Minneapolis Public Library", "description": "\"1889 - 1961. Fronted on Hennepin Avenue at 10th St Designed by Long and Kees.  (Mpls. City Hall.) Built with Lake Super sandstone.\"", "x": -7.644042969, "y": 8.71875}, {"name": "Hennepin Ave Bridge ", "description": "\"Hennepin Ave. Bridge - Nice streetcar!\"", "x": -10.12451172, "y": 116.109375}, {"name": "Our Lady of Lourdes Catholic Church", "description": "\"Our Lady of Lourdes Catholic Church - Built between 1854 and 1857 it is the oldest church building in Minneapolis and has been in continuous use since the mid-19th century.\"", "x": -7.134521484, "y": 137.140625}, {"name": "Globe Building", "description": "\"Globe Building - 1889 - 1958 20 4th St. So (btwn Hennepin and Nicollet). Demolished 1958, now site of Hennepin County Central Library.  Richard Sear's add an office in this building before starting his mail order company.\"", "x": -10.20654297, "y": 55.359375}, {"name": "Minnesota Loan and Trust Building", "description": "\"Minnesota Loan and Trust Building -- 311-315 Nicollet Avenue. Hodgson & Son's. 1885 - 1920(?). Minneapolis's first skyscraper.  Tower was 150 ft.  The site is now occupied by 365 Nicollet, luxury apartments.  Demolished in 1920, F.W. Woolworth's and then the Sheraton-Ritz Hotel later stood on this site.  In 1885 it was the tallest building in the city for a year until topped by the 10 story Lumber Exchange.\"", "x": -10.43920898, "y": 62.71875}, {"name": "Crown Roller Mill Building", "description": "\"Crown Roller Mill Building -- Currently an office building.  105 S 5th Ave, Minneapolis, MN 55401\"", "x": -10.25341797, "y": 160.296875}, {"name": "Bank of Minneapolis", "description": "\"Bank of Minneapolis -- SW corner of Nicollet Ave and 3rd St.  Hodgson and Son. 1887-1958. Now site of Hennepin County Central Library demolished in 1958 as part of the Gateway Project.", "x": -13.51733398, "y": 61.5078125}, {"name": "Minneapolis", "description": "\"The Stone Arch Bridge, with railroad tracks.\"", "x": -7.642333984, "y": 176.109375}, {"name": "The New York Life Insurance Company Building", "description": "\"The New York Life Insurance Company -- 5th St and 2nd Ave.  1890 - 1958  Babb, Cook, & Willard.  Main entrance on 5th St.  Demolished 1958 for the 28 story First National Bank of Minneapolis.  Now The Canadian Pacific  Railway regional offices.\"", "x": -15.78466797, "y": 20.0}, {"name": "Syndicate Block and Grand Opera House", "description": "\"Syndicate Block and Grand Opera House - 1883-97, 1989. Kees & Fisk, Cobb.  Became home of J.C Penny & Company in 1950's. Demolished 1989.  Now Centerpoint Energy, RBC Plaza\"", "x": -12.56591797, "y": 27.75}, {"name": "BNSF/Northstar RR Bridge", "description": "\"BNSF/Northstar RR Bridge -- Still there!\"", "x": -9.306396484, "y": 105.765625}, {"name": "Dude on a rooftop", "description": "\"Dude on a rooftop - Probably wondering what those other guys are doing on the rooftop with a camera.\"", "x": -10.97336124, "y": 46.38425098}, {"name": "Twin City Rapid Transit Company Steam Power Plant", "description": "\"The Twin City Rapid Transit Company Steam Power Plant was built in 1903 to provide power for the street car system.  It is currently called the Southeast Steam Plant and is used by the University of Minnesota to provide steam heat and electricity for parts of the campus.\"", "x": -7.361562252, "y": 179.3681102}, {"name": "Nicollet Island Inn", "description": "\"Nicollet Island Inn -- Originally the Island Sash & Door Company.\"", "x": -9.095458984, "y": 127.96875}, {"name": "Nicollet Island Pavilion", "description": "\"The Nicollet Island Pavilion in this photo is almost exactly the same however it is missing the smoke stack.\"", "x": -9.774108887, "y": 134.4404907}, {"name": "Jewel Stoves billboard", "description": "\"A Detroit Stove Works brand. The company used Upper Peninsula iron ore. Now part of Wellbilt Corp. https://detroithistorical.org/learn/encyclopedia-of-detroit/detroit-stove-works \"", "x": -8.652099609, "y": 68.6640625}, {"name": "North Star Blankets sign", "description": "\"North Star Blankets sign - Similar to current North Star Blankets sign\"", "x": -13.11230447, "y": 126.9088861}, {"name": "Leafy Courtyard", "description": "\"A little oasis just across from the depot. Would be where the Latitude 45 apartments are now.\"", "x": -22.18249512, "y": 143.8945313}, {"name": "Hotel Allen", "description": "\"Opened April 1, 1901, by Swedish immigrants Johan and Gustavus Allen.\"", "x": -21.98749995, "y": 89.54434737}, {"name": "Power's Mercantile Company", "description": "\"215 Nicollet Ave 1906, cost of construction$130,000 for the four story building.    In 1929 Powers Mercantile purchased a 99 year lease on the building. The first escalators in Minneapolis were installed in 1930, costing $60, 000.  Neither the company nor the building survived the 99 years. The department store closed in 1985.  The site in occupied by The Nic, a luxury apartment tower.\"", "x": -12.59545898, "y": 39.25}]