[{"name": "Milwaukee Road Depot Clock Tower", "description": "\"The depot for the Milwaukee Road (Chicago, Milwaukee, and St. Paul Raiway) should look quite familiar to those who know the present-day hotel. But one prominent detail is different: the clock tower. Larry Millett's AIA Guide to the Twin Cities reports that the pinnacle (modeled on the Giralda in Seville, Spain) was damaged by high winds in 1941, leading to the present flat top.\"", "x": -13.826172, "y": 129.3125}, {"name": "Tent city?", "description": "\"I'd love to know the story of this little grouping of tents.\" I could not find records about it in newspapers at the time, but it is approximately where the Centurylink building is today. We will see if there's any other details we can uncover -- ER", "x": -27.204834, "y": 26.234375}, {"name": "Minneapolis Brewing Company", "description": "\"The Minneapolis Brewing Company began as a merger of four of the largest breweries in Minneapolis under the name of the Minneapolis Brewing and Malting Company.\"", "x": -6.2595215, "y": 99.140625}, {"name": "Washington Avenue Bikelane", "description": "\"It appears that this gentleman is establishing the first bike lane on Washington Avenue.\"", "x": -21.246948, "y": 123.871094}, {"name": "Nicollet Island", "description": "\"Apartment block at corner of W. Island and Grove St. Still extant.\"", "x": -9.3589844, "y": 109.630563}, {"name": "Dayton's", "description": "\"The original Dayton's department store.\"", "x": -9.4039062, "y": 10.375}, {"name": "Dayton's Building", "description": "\"Dayton's Building. At the time of this photo, the building would have housed the Dayton Dry Goods Company.\"", "x": -9.7781248, "y": 10.5506608}, {"name": "Nicollet Island bridge", "description": "\"Nicollet Island Bridge - Incredible to see such clarity\"", "x": -6.1481934, "y": 6.51171875}, {"name": "Pracna on Main", "description": "\"Pracna on Main built in 1890\"", "x": -7.8953857, "y": 150.5625}, {"name": "Old Orpheum Theater.", "description": "\"Modern Vaudeville”", "x": -9.3354492, "y": 19.875}, {"name": "Pillsbury \"A\" Mill", "description": "\"In 1879, after five years of secret planning, Charles Alfred Pillsbury announced to the public that he would build the largest and most advanced flour mill the world had ever seen. Construction started in 1880 and was finished in 1881 under a contractor named George McMullen. The mill was built to put out 5,000 barrels a day at a time when a 500-barrel mill was considered large.\"", "x": -6.6531982, "y": 160.570313}, {"name": "Food stand", "description": "\"Cool street vendor with a horse cart passing by\"", "x": -18.27713, "y": 2.80871582}, {"name": "Milwaukee Depot", "description": "\"Milwaukee Depot - Still standing today!\"", "x": -15.158447, "y": 129.892966}, {"name": "Masonic Temple", "description": "\"An example of Richardsonian Romanesque style of architecture, it was built to provide offices and lodging space for the Masonic Temple Association of Minneapolis. The Moorish onion domes on the corner towers were removed to deterioration.\"", "x": -8.6384277, "y": 34.65625}, {"name": "De LaSalle High School", "description": "\"Then-Archbishop John Ireland helped raise money in the late 1800s to build the new Catholic secondary school in Minneapolis. Fifty boys joined three teaching Christian Brothers in the new school in October 1900. The number of pupils rapidly expanded, and by spring, a fourth Brother had arrived to handle the overcrowding. By 1907, an addition had been added to the original building.\"", "x": -9.111084, "y": 111.335938}, {"name": "Dean Ballot Machine Co.", "description": "\"Dean Ballot Machine Co. -- Some sort of fracas outside the ballot company.\"", "x": -13.953979, "y": 162.222656}, {"name": "Rail yards", "description": "\"Lots of people riding the boxcars.\"", "x": -12.00085449, "y": 180.515625}, {"name": "Butler Brothers Company building", "description": "\"Originally built as a warehouse for Butler Brothers, a mail-order firm. The interior is built with heavy timber posts and beams from Aitkin, Minnesota. As truck transportation become more competitive with rail, it's urban location made it inefficient as a warehouse.\"", "x": -8.216552734, "y": 39.6015625}, {"name": "Donaldson's Glass Block", "description": "\"6th St and Nicollet Ave. 60ft Dome.  Destroyed by fire Thanksgiving 1982.\"", "x": -9.987792969, "y": 21.78125}, {"name": "Minneapolis Public Library", "description": "\"1889 - 1961. Fronted on Hennepin Avenue at 10th St Designed by Long and Kees.  (Mpls. City Hall.) Built with Lake Super sandstone.\"", "x": -7.644042969, "y": 8.71875}, {"name": "Hennepin Ave Bridge ", "description": "\"Hennepin Ave. Bridge - Nice streetcar!\"", "x": -10.12451172, "y": 116.109375}]